espruino/Espruino/targets/nrf5x/bluetooth.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

// -----------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------

#define ADVERTISE_MAX_UUIDS             4 ///< maximum custom UUIDs to advertise

#if NRF_SD_BLE_API_VERSION < 5
static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
#else
BLE_NUS_DEF(m_nus);                                                                 /**< Structure to identify the Nordic UART Service. */
#endif

#if BLE_HIDS_ENABLED
#if NRF_SD_BLE_API_VERSION < 5
static ble_hids_t                       m_hids;                                   /**< Structure used to identify the HID service. */
#else
BLE_HIDS_DEF(m_hids);
#endif
static bool                             m_in_boot_mode = false;
#endif

volatile uint16_t                       m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
#if CENTRAL_LINK_COUNT>0
volatile uint16_t                       m_central_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle for central mode connection */
#endif
#ifdef USE_NFC
volatile bool nfcEnabled = false;
#endif

uint16_t bleAdvertisingInterval = DEFAULT_ADVERTISING_INTERVAL;

volatile BLEStatus bleStatus = 0;
ble_uuid_t bleUUIDFilter;
uint16_t bleFinalHandle;


// -----------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------

/// Add a new bluetooth event to the queue with a buffer of data
void jsble_queue_pending_buf(BLEPending blep, uint16_t data, char *ptr, size_t len) {
  // Push the data for the event first
  while (len) {
    int evtLen = len;
    if (evtLen > IOEVENT_MAXCHARS) evtLen=IOEVENT_MAXCHARS;
    IOEvent evt;
    evt.flags = EV_BLUETOOTH_PENDING_DATA;
    IOEVENTFLAGS_SETCHARS(evt.flags, evtLen);
    memcpy(evt.data.chars, ptr, evtLen);
    jshPushEvent(&evt);
    ptr += evtLen;
    len -= evtLen;
  }
  // Push the actual event
  JsSysTime d = (JsSysTime)((data<<8)|blep);
  jshPushIOEvent(EV_BLUETOOTH_PENDING, d);
  jshHadEvent();
}

/// Add a new bluetooth event to the queue with 16 bits of data
void jsble_queue_pending(BLEPending blep, uint16_t data) {
  JsSysTime d = (JsSysTime)((data<<8)|blep);
  jshPushIOEvent(EV_BLUETOOTH_PENDING, d);
  jshHadEvent();
}

/// Executes a pending BLE event - returns the number of events Handled
int jsble_exec_pending(IOEvent *event) {
  int eventsHandled = 1;
  // if we got event data, unpack it first into a buffer
  unsigned char buffer[64];
  assert(sizeof(buffer) >= sizeof(ble_gap_evt_adv_report_t));
  assert(sizeof(buffer) >= GATT_MTU_SIZE_DEFAULT);
  size_t bufferLen = 0;
  while (IOEVENTFLAGS_GETTYPE(event->flags) == EV_BLUETOOTH_PENDING_DATA) {
    int i, chars = IOEVENTFLAGS_GETCHARS(event->flags);
    for (i=0;i<chars;i++) {
      assert(bufferLen < sizeof(buffer));
      if (bufferLen < sizeof(buffer))
        buffer[bufferLen++] = event->data.chars[i];
    }

    jshPopIOEvent(event);
    eventsHandled++;
  }
  assert(IOEVENTFLAGS_GETTYPE(event->flags) == EV_BLUETOOTH_PENDING);

  // Now handle the actual event
  BLEPending blep = (BLEPending)event->data.time;
  uint16_t data = (uint16_t)(event->data.time>>8);
  switch (blep) {
   case BLEP_NONE: break;
   case BLEP_CONNECTED: {
     assert(bufferLen == sizeof(ble_gap_addr_t));
     ble_gap_addr_t *peer_addr = (ble_gap_addr_t*)buffer;
     bleQueueEventAndUnLock(JS_EVENT_PREFIX"connect", bleAddrToStr(*peer_addr));
     jshHadEvent();
     break;
   }
   case BLEP_DISCONNECTED: {
     JsVar *reason = jsvNewFromInteger(data);
     bleQueueEventAndUnLock(JS_EVENT_PREFIX"disconnect", reason);
     break;
   }
   case BLEP_RSSI_PERIPH: {
     JsVar *evt = jsvNewFromInteger((char)data);
     if (evt) jsiQueueObjectCallbacks(execInfo.root, BLE_RSSI_EVENT, &evt, 1);
     jsvUnLock(evt);
     break;
   }
   case BLEP_ADV_REPORT: {
     ble_gap_evt_adv_report_t *p_adv = (ble_gap_evt_adv_report_t *)buffer;
     if (bufferLen < sizeof(ble_gap_evt_adv_report_t)) {
       assert(0);
       break;
     }
     JsVar *evt = jsvNewObject();
     if (evt) {
       jsvObjectSetChildAndUnLock(evt, "rssi", jsvNewFromInteger(p_adv->rssi));
       //jsvObjectSetChildAndUnLock(evt, "addr_type", jsvNewFromInteger(blePendingAdvReport.peer_addr.addr_type));
       jsvObjectSetChildAndUnLock(evt, "id", bleAddrToStr(p_adv->peer_addr));
       JsVar *data = jsvNewStringOfLength(p_adv->dlen, (char*)p_adv->data);
       if (data) {
         JsVar *ab = jsvNewArrayBufferFromString(data, p_adv->dlen);
         jsvUnLock(data);
         jsvObjectSetChildAndUnLock(evt, "data", ab);
       }
       // push onto queue
       jsiQueueObjectCallbacks(execInfo.root, BLE_SCAN_EVENT, &evt, 1);
       jsvUnLock(evt);
     }
     break;
   }
   case BLEP_WRITE: {
     JsVar *evt = jsvNewObject();
     if (evt) {
       JsVar *str = jsvNewStringOfLength(bufferLen, (char*)buffer);
       if (str) {
         JsVar *ab = jsvNewArrayBufferFromString(str, bufferLen);
         jsvUnLock(str);
         jsvObjectSetChildAndUnLock(evt, "data", ab);
       }
       char eventName[12];
       bleGetWriteEventName(eventName, data);
       jsiQueueObjectCallbacks(execInfo.root, eventName, &evt, 1);
       jsvUnLock(evt);
     }
     break;
   }
#if CENTRAL_LINK_COUNT>0
   case BLEP_RSSI_CENTRAL: {
     JsVar *gattServer = bleGetActiveBluetoothGattServer();
     if (gattServer) {
       JsVar *rssi = jsvNewFromInteger((char)data);
       JsVar *bluetoothDevice = jsvObjectGetChild(gattServer, "device", 0);
       if (bluetoothDevice) {
         jsvObjectSetChild(bluetoothDevice, "rssi", rssi);
       }
       jsiQueueObjectCallbacks(gattServer, BLE_RSSI_EVENT, &rssi, 1);
       jsvUnLock3(rssi, gattServer, bluetoothDevice);
     }
     break;
   }
   case BLEP_TASK_FAIL_CONN_TIMEOUT:
     bleCompleteTaskFailAndUnLock(bleGetCurrentTask(), jsvNewFromString("Connection Timeout"));
     break;
   case BLEP_TASK_FAIL_DISCONNECTED:
     bleCompleteTaskFailAndUnLock(bleGetCurrentTask(), jsvNewFromString("Disconnected"));
     break;
   case BLEP_TASK_CENTRAL_CONNECTED:
     jsvObjectSetChildAndUnLock(bleTaskInfo, "connected", jsvNewFromBool(true));
     bleCompleteTaskSuccess(BLETASK_CONNECT, bleTaskInfo);
     break;
   case BLEP_TASK_DISCOVER_SERVICE: {
     if (!bleInTask(BLETASK_PRIMARYSERVICE)) {
       jsExceptionHere(JSET_INTERNALERROR,"Wrong task: %d vs %d", bleGetCurrentTask(), BLETASK_PRIMARYSERVICE);
       break;
     }
     ble_gattc_service_t *p_srv = (ble_gattc_service_t*)buffer;
     if (!bleTaskInfo) bleTaskInfo = jsvNewEmptyArray();
     if (!bleTaskInfo) break;
     JsVar *o = jspNewObject(0, "BluetoothRemoteGATTService");
     if (o) {
       jsvObjectSetChildAndUnLock(o,"uuid", bleUUIDToStr(p_srv->uuid));
       jsvObjectSetChildAndUnLock(o,"isPrimary", jsvNewFromBool(true));
       jsvObjectSetChildAndUnLock(o,"start_handle", jsvNewFromInteger(p_srv->handle_range.start_handle));
       jsvObjectSetChildAndUnLock(o,"end_handle", jsvNewFromInteger(p_srv->handle_range.end_handle));
       jsvArrayPushAndUnLock(bleTaskInfo, o);
     }
     break;
   }
   case BLEP_TASK_DISCOVER_SERVICE_COMPLETE: {
     // When done, send the result to the handler
     if (bleTaskInfo && bleUUIDFilter.type != BLE_UUID_TYPE_UNKNOWN) {
       // single item because filtering
       JsVar *t = jsvSkipNameAndUnLock(jsvArrayPopFirst(bleTaskInfo));
       jsvUnLock(bleTaskInfo);
       bleTaskInfo = t;
     }
     if (bleTaskInfo) bleCompleteTaskSuccess(BLETASK_PRIMARYSERVICE, bleTaskInfo);
     else bleCompleteTaskFailAndUnLock(BLETASK_PRIMARYSERVICE, jsvNewFromString("No Services found"));
     break;
   }
   case BLEP_TASK_DISCOVER_CHARACTERISTIC: {
        if (!bleInTask(BLETASK_CHARACTERISTIC)) {
          jsExceptionHere(JSET_INTERNALERROR,"Wrong task: %d vs %d", bleGetCurrentTask(), BLETASK_PRIMARYSERVICE);
          break;
        }
        ble_gattc_char_t *p_chr = (ble_gattc_char_t*)buffer;
        if (!bleTaskInfo) bleTaskInfo = jsvNewEmptyArray();
        if (!bleTaskInfo) break;
        JsVar *o = jspNewObject(0, "BluetoothRemoteGATTCharacteristic");
        if (o) {
          jsvObjectSetChildAndUnLock(o,"uuid", bleUUIDToStr(p_chr->uuid));
          jsvObjectSetChildAndUnLock(o,"handle_value", jsvNewFromInteger(p_chr->handle_value));
          jsvObjectSetChildAndUnLock(o,"handle_decl", jsvNewFromInteger(p_chr->handle_decl));
          JsVar *p = jsvNewObject();
          if (p) {
            jsvObjectSetChildAndUnLock(p,"broadcast",jsvNewFromBool(p_chr->char_props.broadcast));
            jsvObjectSetChildAndUnLock(p,"read",jsvNewFromBool(p_chr->char_props.read));
            jsvObjectSetChildAndUnLock(p,"writeWithoutResponse",jsvNewFromBool(p_chr->char_props.write_wo_resp));
            jsvObjectSetChildAndUnLock(p,"write",jsvNewFromBool(p_chr->char_props.write));
            jsvObjectSetChildAndUnLock(p,"notify",jsvNewFromBool(p_chr->char_props.notify));
            jsvObjectSetChildAndUnLock(p,"indicate",jsvNewFromBool(p_chr->char_props.indicate));
            jsvObjectSetChildAndUnLock(p,"authenticatedSignedWrites",jsvNewFromBool(p_chr->char_props.auth_signed_wr));
            jsvObjectSetChildAndUnLock(o,"properties", p);
          }
          // char_props?
          jsvArrayPushAndUnLock(bleTaskInfo, o);
        }
        break;
      }
   case BLEP_TASK_DISCOVER_CHARACTERISTIC_COMPLETE: {
     // When done, send the result to the handler
     if (bleTaskInfo && bleUUIDFilter.type != BLE_UUID_TYPE_UNKNOWN) {
       // single item because filtering
       JsVar *t = jsvSkipNameAndUnLock(jsvArrayPopFirst(bleTaskInfo));
       jsvUnLock(bleTaskInfo);
       bleTaskInfo = t;
     }
     if (bleTaskInfo) bleCompleteTaskSuccess(BLETASK_CHARACTERISTIC, bleTaskInfo);
     else bleCompleteTaskFailAndUnLock(BLETASK_CHARACTERISTIC, jsvNewFromString("No Characteristics found"));
     break;
   }
   case BLEP_TASK_DISCOVER_CCCD: {
     uint16_t cccd_handle = data;
     if (cccd_handle) {
       if(bleTaskInfo)
         jsvObjectSetChildAndUnLock(bleTaskInfo, "handle_cccd", jsvNewFromInteger(cccd_handle));
       // Switch task here rather than completing...
       bleSwitchTask(BLETASK_CHARACTERISTIC_NOTIFY);
       jsble_central_characteristicNotify(bleTaskInfo, true);
     } else {
       // Couldn't find anything - just report error
       bleCompleteTaskFailAndUnLock(BLETASK_CHARACTERISTIC_DESC_AND_STARTNOTIFY, jsvNewFromString("CCCD Handle not found"));
     }
     break;
   }
   case BLEP_TASK_CHARACTERISTIC_READ: {
     JsVar *d = jsvNewDataViewWithData(bufferLen, buffer);
     jsvObjectSetChild(bleTaskInfo, "value", d); // set this.value
     bleCompleteTaskSuccessAndUnLock(BLETASK_CHARACTERISTIC_READ, d);
     break;
   }
   case BLEP_TASK_CHARACTERISTIC_WRITE: {
     bleCompleteTaskSuccess(BLETASK_CHARACTERISTIC_WRITE, 0);
     break;
   }
   case BLEP_TASK_CHARACTERISTIC_NOTIFY: {
     bleCompleteTaskSuccess(BLETASK_CHARACTERISTIC_NOTIFY, 0);
     break;
   }
   case BLEP_CENTRAL_DISCONNECTED: {
     JsVar *gattServer = bleGetActiveBluetoothGattServer();
     if (gattServer) {
       JsVar *bluetoothDevice = jsvObjectGetChild(gattServer, "device", 0);
       jsvObjectSetChildAndUnLock(gattServer, "connected", jsvNewFromBool(false));
       if (bluetoothDevice) {
         // HCI error code, see BLE_HCI_STATUS_CODES in ble_hci.h
         JsVar *reason = jsvNewFromInteger(data);
         jsiQueueObjectCallbacks(bluetoothDevice, JS_EVENT_PREFIX"gattserverdisconnected", &reason, 1);
         jsvUnLock(reason);
         jshHadEvent();
       }
       jsvUnLock2(gattServer, bluetoothDevice);
     }
     bleSetActiveBluetoothGattServer(0);
     break;
   }
   case BLEP_NOTIFICATION: {
     JsVar *handles = jsvObjectGetChild(execInfo.hiddenRoot, "bleHdl", 0);
     if (handles) {
       JsVar *characteristic = jsvGetArrayItem(handles, data/*the handle*/);
       if (characteristic) {
         // Set characteristic.value, and return {target:characteristic}
         jsvObjectSetChildAndUnLock(characteristic, "value",
             jsvNewDataViewWithData(bufferLen, (unsigned char*)buffer));
         JsVar *evt = jsvNewObject();
         if (evt) {
           jsvObjectSetChild(evt, "target", characteristic);
           jsiQueueObjectCallbacks(characteristic, JS_EVENT_PREFIX"characteristicvaluechanged", &evt, 1);
           jshHadEvent();
           jsvUnLock(evt);
         }
       }
       jsvUnLock2(characteristic, handles);
     }
     break;
   }
#endif
#if PEER_MANAGER_ENABLED
   case BLEP_TASK_BONDING: {
     if (data) bleCompleteTaskSuccess(BLETASK_BONDING, 0);
     else bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Securing failed"));
     break;
   }
#endif
#ifdef USE_NFC
   case BLEP_NFC_STATUS:
     bleQueueEventAndUnLock(data ? JS_EVENT_PREFIX"NFCon" : JS_EVENT_PREFIX"NFCoff", 0);
     break;
   case BLEP_NFC_TX:
     bleQueueEventAndUnLock(JS_EVENT_PREFIX"NFCtx", 0);
     break;
   case BLEP_NFC_RX: {
     /* try to fetch NfcData data */
     JsVar *nfcData = jsvObjectGetChild(execInfo.hiddenRoot, "NfcData", 0);
     if(nfcData) {
       /* success - handle request internally */
       JSV_GET_AS_CHAR_ARRAY(nfcDataPtr, nfcDataLen, nfcData);
       jsvUnLock(nfcData);

       /* check data, on error let request go into timeout - reader will retry. */
       if (!nfcDataPtr || !nfcDataLen) {
         break;
       }

       /* check rx data length and read block command code (0x30) */
       if(bufferLen < 2 || buffer[0] != 0x30) {
         jsble_nfc_send_rsp(0, 0); /* switch to rx */
         break;
       }

       /* fetch block index (addressing is done in multiples of 4 byte */
       size_t idx = buffer[1] * 4;

       /* assemble 16 byte block */
       uint8_t buf[16]; memset(buf, '\0', 16);
       if(idx + 16 < nfcDataLen) {
         memcpy(buf, nfcDataPtr + idx, 16);
       } else
       if(idx < nfcDataLen) {
         memcpy(buf, nfcDataPtr + idx, nfcDataLen - idx);
       }
       /* send response */
       jsble_nfc_send(buf, 16);
     } else {
       /* no NfcData available, fire js-event */
       bleQueueEventAndUnLock(JS_EVENT_PREFIX"NFCrx",
           jsvNewArrayBufferWithData(bufferLen, buffer));
     }
     break;
   }
#endif
#if BLE_HIDS_ENABLED
   case BLEP_HID_SENT:
     jsiQueueObjectCallbacks(execInfo.root, BLE_HID_SENT_EVENT, 0, 0);
     jsvObjectSetChild(execInfo.root, BLE_HID_SENT_EVENT, 0); // fire only once
     jshHadEvent();
     break;
#endif
   default:
     jsWarn("jsble_exec_pending: Unknown enum type %d",(int)blep);
 }
 return eventsHandled;
}


// -----------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------


